src/cf/Catalogs/ПравилаЗагрузкиДанныхВДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПравилаЗагрузкиДанныхВДО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзМакета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъектаДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъектаИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФайловСохраненияПечатныхФорм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФайловСохраненияПечатныхФормОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелИнтегрированнойСистемы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ИнтегрированныеСистемы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаЗаполненияРеквизитовДО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вариант</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыПравилЗаполненияРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВычисляемоеВыражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныйРеквизитДО</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизитаДО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизитаДОСтрока</Name>
							<Comment>Хранит в себе строку неограниченной длины</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяМетодаДляЗаполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяМетодаПроверкиДоступностиПоСостоянию</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоляПроверкиДоступностиПоСостоянию</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизитаОбъектаДО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизитаОбъектаИС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоВыполненияВыражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.МестаВыполненияВыраженийНаВстроенномЯзыке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обновлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилаЗаполненияСтрокТаблицы</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Таблица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРеквизитаОбъектаДОВСтроку</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоДополнительныйРеквизитДО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоТаблица</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрисоединяемыеПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МенеджерПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обновлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольФайла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеПараметры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВариантыПравилЗаполненияРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыПравилЗаполненияРеквизитов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыражениеНаВстроенномЯзыке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзШаблона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитТаблицы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтрокиТаблицы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УказанноеЗначение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПравилаЗагрузкиДанныхВДО/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ПроверитьВозможностьЗаписиПравила();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПредставление();
	
	Для Каждого ПравилоЗаполнения Из ПравилаЗаполненияРеквизитовДО Цикл
		
		Если Не ЗначениеЗаполнено(ПравилоЗаполнения.ID) Тогда
			ПравилоЗаполнения.ID = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
		
		Если ПравилоЗаполнения.Вариант = Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитТаблицы Тогда
			БылиИзменения = Ложь;
			ПравилаЗаполненияСтрокТаблицы = ПравилоЗаполнения.ПравилаЗаполненияСтрокТаблицы.Получить();
			Если ТипЗнч(ПравилаЗаполненияСтрокТаблицы) = Тип("ТаблицаЗначений") Тогда
				БылиИзменения = ОбновитьИдентификаторыПравилаЗаполненияСтрокТаблицы(ПравилаЗаполненияСтрокТаблицы);
			КонецЕсли;
			Если БылиИзменения Тогда
				ПравилоЗаполнения.ПравилаЗаполненияСтрокТаблицы = Новый ХранилищеЗначения(ПравилаЗаполненияСтрокТаблицы);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обновляет представление правила согласно представлениям объектов и ключевых реквизитов.
//
Процедура ОбновитьПредставление()
	
	МассивПредставлениеОбъектаДО = Новый Массив;
	МассивПредставлениеОбъектаДО.Добавить(ПредставлениеОбъектаДО);
	
	Если СокрЛП(Комментарий) <> "" Тогда
		МассивПредставлениеОбъектаДО.Добавить(СокрЛП(Комментарий));
	КонецЕсли;
	
	// Соберем наименование.
	Наименование = СтрШаблон("%1 - %2", СтрСоединить(МассивПредставлениеОбъектаДО, ", "), ПредставлениеОбъектаИС);
	
КонецПроцедуры

Функция ОбновитьИдентификаторыПравилаЗаполненияСтрокТаблицы(ПравилаЗаполненияСтрокТаблицы)
	
	БылиИзменения = Ложь;
	
	Для Каждого Строка Из ПравилаЗаполненияСтрокТаблицы Цикл
		Для Каждого Колонка Из ПравилаЗаполненияСтрокТаблицы.Колонки Цикл
			Если Прав(Колонка.Имя, 3) <> "_ID" Или ЗначениеЗаполнено(Строка[Колонка.Имя]) Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяРеквизита = Лев(Колонка.Имя, СтрДлина(Колонка.Имя) - 3);
			Если ЗначениеЗаполнено(Строка[СтрШаблон("%1_Вариант", ИмяРеквизита)]) Тогда
				Строка[СтрШаблон("%1_ID", ИмяРеквизита)] = Строка(Новый УникальныйИдентификатор);
				БылиИзменения = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат БылиИзменения;
	
КонецФункции

Процедура ПроверитьВозможностьЗаписиПравила()
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыраженийДляЗаполненияРеквизитовДО = Новый Соответствие;
	СписокВыраженийДляЗаполненияРеквизитовТаблицыДО = Новый Соответствие;
	
	Для Каждого Строка Из ПравилаЗаполненияРеквизитовДО Цикл
		Ключ = Новый Структура("ИмяРеквизитаОбъектаДО, ЭтоТаблица, Таблица");
		ЗаполнитьЗначенияСвойств(Ключ, Строка);
		Если ЗначениеЗаполнено(Строка.ВычисляемоеВыражение) Тогда
			СписокВыраженийДляЗаполненияРеквизитовДО.Вставить(Ключ, Строка.ВычисляемоеВыражение);
		КонецЕсли;
		ПравилаЗаполненияСтрокТаблицы = Строка.ПравилаЗаполненияСтрокТаблицы.Получить();
		Если ТипЗнч(ПравилаЗаполненияСтрокТаблицы) = Тип("ТаблицаЗначений") Тогда
			МассивВыражений = Новый Массив;
			Для Каждого СтрокаТаблицы Из ПравилаЗаполненияСтрокТаблицы Цикл
				Для Каждого Колонка Из ПравилаЗаполненияСтрокТаблицы.Колонки Цикл
					Если Прав(Колонка.Имя, 21) <> "_ВычисляемоеВыражение" Тогда
						Продолжить;
					КонецЕсли;
					Если ЗначениеЗаполнено(СтрокаТаблицы[Колонка.Имя])
							И МассивВыражений.Найти(СтрокаТаблицы[Колонка.Имя]) = Неопределено Тогда
						МассивВыражений.Добавить(СтрокаТаблицы[Колонка.Имя]);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Если МассивВыражений.Количество() > 0 Тогда
				СписокВыраженийДляЗаполненияРеквизитовТаблицыДО.Вставить(Ключ, МассивВыражений);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если СписокВыраженийДляЗаполненияРеквизитовДО.Количество() = 0
			И СписокВыраженийДляЗаполненияРеквизитовТаблицыДО.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ВызватьИсключение НСтр("ru = 'В правилах загрузки данных в 1С:Документооборот запрещено изменять выражения на встроенном языке.
			|Обратитесь к администратору.'");
	КонецЕсли;
	
	СтарыеПравилаЗаполненияРеквизитовДО =
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПравилаЗаполненияРеквизитовДО").Выгрузить();
	
	Для Каждого ТекущееВыражение Из СписокВыраженийДляЗаполненияРеквизитовДО Цикл
		Строки = СтарыеПравилаЗаполненияРеквизитовДО.НайтиСтроки(ТекущееВыражение.Ключ);
		Если Строки.Количество() = 1 И Строки[0].ВычисляемоеВыражение = ТекущееВыражение.Значение Тогда
			Продолжить;
		КонецЕсли;
		ВызватьИсключение НСтр("ru = 'В правилах загрузки данных в 1С:Документооборот запрещено изменять выражения на встроенном языке.
			|Обратитесь к администратору.'");
	КонецЦикла;
	
	Для Каждого ТекущиеВыражения Из СписокВыраженийДляЗаполненияРеквизитовТаблицыДО Цикл
		Строки = СтарыеПравилаЗаполненияРеквизитовДО.НайтиСтроки(ТекущиеВыражения.Ключ);
		Если Строки.Количество() <> 1 Тогда
			ВызватьИсключение НСтр("ru = 'В правилах загрузки данных в 1С:Документооборот запрещено изменять выражения на встроенном языке.
				|Обратитесь к администратору.'");
		КонецЕсли;
		СтарыеПравилаЗаполненияСтрокТаблицы = Строки[0].ПравилаЗаполненияСтрокТаблицы.Получить();
		МассивСтарыхВыражений = Новый Массив;
		Для Каждого СтрокаТаблицы Из СтарыеПравилаЗаполненияСтрокТаблицы Цикл
			Для Каждого Колонка Из СтарыеПравилаЗаполненияСтрокТаблицы.Колонки Цикл
				Если Прав(Колонка.Имя, 21) <> "_ВычисляемоеВыражение" Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаТаблицы[Колонка.Имя])
						И МассивСтарыхВыражений.Найти(СтрокаТаблицы[Колонка.Имя]) = Неопределено Тогда
					МассивСтарыхВыражений.Добавить(СтрокаТаблицы[Колонка.Имя]);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Для Каждого ТекущееВыражение Из ТекущиеВыражения.Значение Цикл
			Если МассивСтарыхВыражений.Найти(ТекущееВыражение) = Неопределено Тогда
				ВызватьИсключение НСтр("ru = 'В правилах загрузки данных в 1С:Документооборот запрещено изменять выражения на встроенном языке.
					|Обратитесь к администратору.'");
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
